1. 登陆时，用Email地址作为用户名登陆。[OK]

2. AE 不需要添加/编辑 客户的销售人员/客户的经销商， 换言之，只有客户有权限添加/编辑 销售人员和经销商。[OK]

3. AE 添加完客户，客户初次通过邮件中的Link登陆系统时，不能立即修改密码，页面出错.[OK]

4. 自动发送的Email在Foxmail中，显示乱码。[?]

5. 编辑销售人员和经销商时，不能改其所属客户。[客户自己本身是不能转移所属销售员/经销商为另外的客户.AE 不能修改客户的销售员/经销商.目前只有管理员可以修改.]

6. 添加产品中的流水号，改名字为产品编号。添加产品中加一个判断，即数量不能低于最小打包数量。[OK]

7. 管理员的权限中，多了一个添加仓库信息。仓库表中，只需要两个字段，即仓库名称及邮箱地址。（该邮箱地址就是仓库管理员的邮箱地址）。也就是说，再也没有仓库管理员管理了。只有Admin才有权限加仓库，也就是仓库管理员邮箱地址。[OK]

8. 所有系统发出的邮件，统一用地址：“shanghai@hf-ps.com”。 [OK]

9. 当销售员或经销商申请产品时，数据库中要冻结申请的产品数量。比如，产品：笔记本，库存5000本。经销商A要求申请2000本，此时状态为等待审批，数据库的库存应为3000本，2000本被经销商A冻结。此时经销商B只能申请最多3000本。但是当客户驳回经销商A的申请时，经销商B就可以申请5000本了。冻结时的库存低于20%时，不用发邮件提醒客户及AE。[OK]

10. 产品申请列表需要加一列，缩略图，没有的话，就显示空。[OK]

11. 每一个发货地址应有相应的联系人和电话信息。不能光就只有地址。

12. 申请产品完成之后，邮件发送给相应客户，客户也是通过邮件中的超链接打开网站页面，该页面中要有，审批，修改和驳回三个按钮。修改按钮，就是修改数量，然后审批修改后的数量。[jackey]

13. 客户审批产品列表中不再需要审批，编辑按钮。列表中加一个字段为审批时间。该列表只需要查看，不用操作。[jackey]

14. 申请产品界面及添加产品界面改动。可在Skype上详聊。





